Revit 2027 API
SolidCurveIntersectionOptions.ResultType Property
 The type of results expected by the calculation. The default is CurveSegmentsInside.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SolidCurveIntersectionMode ResultType { get; set; }
Public Property ResultType As SolidCurveIntersectionMode
	Get
	Set
public:
property SolidCurveIntersectionMode ResultType {
	SolidCurveIntersectionMode get ();
	void set (SolidCurveIntersectionMode value);
}
member ResultType : SolidCurveIntersectionMode with get, set
Property Value
SolidCurveIntersectionMode
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace